app/views/recipes/index.html.erb

        <% end %>
        <span>Rating: <%= recipe.average_rating %>/5 (<%= recipe.reviews.size %> reviews)</span>
---
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."recipe_id" = 69
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" IN (1, 2, 35, 3, 13, 4, 14, 15, 5, 6, 16, 7, 25, 8, 20, 17, 9, 21, 10, 26, 18, 11, 12, 28, 22, 19, 23, 24, 34, 30, 31, 27, 29, 32, 33, 37, 38, 36, 39, 40, 72, 53, 41, 42, 64, 54, 43, 61, 44, 55, 45, 56, 46, 57, 47, 48, 49, 50, 51, 58, 68, 52, 65, 62, 59, 60, 66, 63, 71, 70, 69, 67, 74, 75, 73, 76, 77, 78, 79, 80, 89, 90, 81, 97, 91, 82, 83, 84, 92, 85, 86, 87, 93, 88, 98, 99, 94, 95, 96, 100)