app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = 29
SELECT 1 AS one FROM "ingredients" WHERE "ingredients"."recipe_id" = 29 LIMIT 1
---
    <h3>Ingredients</h3>
    <% if @recipe.ingredients.any? %>
      <ul class="ingredients-list">
        <% @recipe.ingredients.each do |ingredient| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = 29 ORDER BY "reviews"."created_at" DESC
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = 29
---
<div class="reviews-section">
  <h3>Reviews (<%= @recipe.reviews.count %>)</h3>
  <% @recipe.reviews.order(created_at: :desc).each do |review| %>